template/trans_ceft.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iib="http://www.sampath.lk/SD/IIBFinacleIntegration/">
   <soapenv:Header/>
   <soapenv:Body>
      <iib:DoInterBankTransferRequest>
         <!--Optional:-->
         <APPCode>VSW</APPCode>
         <!--Optional:-->
         <Controller>CMN</Controller>
         <!--Optional:-->
         <CDCICode>F</CDCICode>
         <!--Optional:-->
         <TerminalID></TerminalID>
         <!--Optional:-->
         <CardNo></CardNo>
         <FromAccNo>900100000801</FromAccNo>
         <!--Optional:-->
         <FromAccType></FromAccType>
         <!--Optional:-->
         <FromAccBankCode>7278</FromAccBankCode>
         <!--Optional:-->
         <FromAccBranchCode></FromAccBranchCode>
         <ToAccNo>100178099707</ToAccNo>
         <!--Optional:-->
         <ToAccName>Lakshan</ToAccName>
         <!--Optional:-->
         <ToAccType></ToAccType>
         <ToAccBankCode>7719</ToAccBankCode>
         <!--Optional:-->
         <ToAccBranchCode></ToAccBranchCode>
         <TxnAmount>555</TxnAmount>
         <CommAmount>15</CommAmount>
         <!--Optional:-->
         <CommAccount>900108020041</CommAccount>
         <!--Optional:-->
         <TranRemarks></TranRemarks>
         <!--Optional:-->
         <ValueDate>05/04/2018</ValueDate>
         <!--Optional:-->
         <SlipsCode></SlipsCode>
         <!--Optional:-->
         <DrCurrencyCode></DrCurrencyCode>
         <!--Optional:-->
         <ChannelType></ChannelType>
         <CEFTFlag>Y</CEFTFlag>
         <FromAccName></FromAccName>
         <!--Optional:-->
         <Reference></Reference>
      </iib:DoInterBankTransferRequest>
   </soapenv:Body>
</soapenv:Envelope>
